УправлениеПаркомАттракционов/src/Documents/ПосещениеАттракциона/ПосещениеАттракциона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПосещениеАттракциона</name>
  <registerRecords>AccumulationRegister.АктивныеПосещения</registerRecords>
  <attributes>
    <name>Аттракцион</name>
    <type>
      <types>CatalogRef.Аттракционы</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеПаркомАттракционов/src/AccumulationRegisters/АктивныеПосещения/АктивныеПосещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АктивныеПосещения</name>
  <resources>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПродажаБилета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УправлениеПаркомАттракционов/src/Documents/ПосещениеАттракциона/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
	
Процедура ОбработкаПроведения(Отказ,Режим)

    Движения.АктивныеПосещения.Записывать = Истина;
    Движения.Записать();
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
	  "ВЫБРАТЬ
	  |	АктивныеПосещенияОстатки.ВидАттракциона,
	  |	АктивныеПосещенияОстатки.КоличествоПосещенийОстаток
	  |ИЗ
	  |	РегистрНакопления.АктивныеПосещения.Остатки(, Основание = &Основание) КАК АктивныеПосещенияОстатки";
	  
	  Запрос.УстановитьПараметр("Основание", Основание);
	  
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 ОсталосьПосещений = 0;
	 ВидАттракционаАбонемента = Неопределено;
	 
	 Если Выборка.Следующий() Тогда
	 	ОсталосьПосещений = Выборка.КоличествоПосещенийОстаток;
	 	ВидАттракционаАбонемента = Выборка.ВидАттракциона;
	 КонецЕсли;
	 
	 Если ОсталосьПосещений < 1 Тогда
	 	Отказ = Истина;
	 	Сообщение = Новый СообщениеПользователю;
	 	Сообщение.Текст = "В билете не осталось посещений.";
	 	Сообщение.УстановитьДанные(ЭтотОбъект);
	 	Сообщение.Поле = "Основание";
	 	Сообщение.Сообщить();
	 КонецЕсли;
	 
	 ВидыАттракционаДокумента = ВидыАттракционов(Аттракцион);
	 Если ЗначениеЗаполнено(ВидАттракционаАбонемента) 
	 И ВидыАттракционаДокумента <> ВидАттракционаАбонемента Тогда
	 	Отказ = Истина;
	 	Сообщение = Новый СообщениеПользователю;
	 	Сообщение.Текст = "Билет не подходит для посещения этого аттракциона.";
	 	Сообщение.УстановитьДанные(ЭтотОбъект);
	 	Сообщение.Поле = "Основание";
	 	Сообщение.Сообщить();
	 КонецЕсли;
	 
	 Если Отказ Тогда
	 	Возврат;
	 КонецЕсли;

	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Основание = Основание;
	Движение.ВидАттракциона = ВидАттракционаАбонемента;
	Движение.КоличествоПосещений = 1;
	 
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВидыАттракционов(Аттракцион)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	Аттракционы.ВидыАттракционов
	    |ИЗ
	    |	Справочник.Аттракционы КАК Аттракционы
	    |ГДЕ
	    |	Аттракционы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Аттракцион);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.ВидыАттракционов;

КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
